import pymorphy3
morph = pymorphy3.MorphAnalyzer()


INTENT_CONFIG = {
    'next_track': {
        ('следующий',): 1.0, 
        ('next',): 1.0, 
        ('скип',): 1.0, 
        ('skip',): 1.0, 
        ('пропустить',): 0.9, 
        ('далёкий',): 0.8, 
        ('переключить',): 0.9, 
        ('включить', 'другой'): 0.8, 
        ('не', 'нравиться'): 0.5, 
        ('давать', 'другой'): 0.6
        }, 
    
    'prev_track': {
        ('предыдущий',): 1.0, 
        ('previous',): 1.0, 
        ('назад',): 0.8, 
        ('вернуть',): 0.8, 
        ('прошлый',): 0.7, 
        ('back',): 0.9, 
        ('вернуть', 'назад'): 1.0
        }, 
    
    'pause': {
        ('пауза',): 1.0, 
        ('стоп',): 1.0, 
        ('stop',): 1.0, 
        ('остановить',): 0.9, 
        ('хватить',): 0.7, 
        ('тишина',): 0.8, 
        ('выключить', 'музыка'): 0.9, 
        ('прекратить',): 0.8
        }, 
    
    'resume': {
        ('продолжить',): 1.0, 
        ('играть',): 0.9, 
        ('play',): 1.0, 
        ('запустить',): 0.8, 
        ('снять', 'с', 'пауза'): 1.0, 
        ('включить', 'обратно'): 0.9
        }, 
    
    'volume_up': {
        ('громкий',): 1.0, 
        ('прибавить',): 0.9, 
        ('добавить', 'звук'): 0.9, 
        ('тихо',): 0.6, 
        ('увеличить', 'громкость'): 1.0, 
        ('плохо', 'слышный'): 0.7, 
        ('louder',): 1.0
        }, 
    
    'volume_down': {
        ('тихий',): 1.0, 
        ('убавить',): 0.9, 
        ('сделать', 'тихий'): 1.0, 
        ('приглушить',): 0.9,
        ('снизить', 'громкость'): 1.0, 
        ('очень', 'громко'): 0.7
        }, 
    
    'replay': {
        ('заново',): 1.0, 
        ('повторить',): 0.8, 
        ('с', 'начало'): 0.9,
        ('ещё', 'раз'): 0.7, 
        ('replay',): 1.0
        }
    }

def _normalize_config(raw_config):
    normalized = {}
    for intent, phrases_dict in raw_config.items():
        normalized[intent] = {}
        for phrase_tuple, weight in phrases_dict.items():
            # Прогоняем каждое слово в кортеже через лемматизатор
            normalized_phrase = tuple(
                morph.parse(word)[0].normal_form 
                for word in phrase_tuple
            )
            normalized[intent][normalized_phrase] = weight
    return normalized

print(_normalize_config(INTENT_CONFIG))